###  Handling Categoical Data.

### 1) One Hot Encoding.

In [1]:
### importing important libraries.
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
titanic=pd.read_csv("E://Datasets//Miscellaneous//Titanic//train.csv",usecols=['Sex'])

In [3]:
titanic.columns

Index(['Sex'], dtype='object')

In [4]:
pd.get_dummies(titanic,drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [5]:
titanic=pd.read_csv("E://Datasets//Miscellaneous//Titanic//train.csv",usecols=['Embarked'])

In [6]:
titanic.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [7]:
titanic.isnull().sum()

Embarked    2
dtype: int64

In [8]:
### dropping null values.
titanic.dropna(inplace=True)

In [9]:
titanic.isnull().sum()

Embarked    0
dtype: int64

In [10]:
pd.get_dummies(titanic,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

### 2) We can solved such problem using most frequent categories and the apply one hot encoding technique.

In [11]:
mer_df=pd.read_csv("E://Datasets//New Dataset//mercedes.csv",usecols=['X0','X1','X2','X3','X4','X5','X6','X8'])
mer_df.head()

   X0 X1  X2 X3 X4 X5 X6 X8
0   k  v  at  a  d  u  j  o
1   k  t  av  e  d  y  l  o
2  az  w   n  c  d  x  j  x
3  az  t   n  f  d  x  l  e
4  az  v   n  f  d  h  d  n

In [12]:
## How to performing one hot encoding with many categorical features.

In [13]:
###finding the nuumbe of categories present in dataset.
for i in mer_df.columns:
    print(mer_df[i].value_counts())

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
ai     34
m      34
e      32
ba     27
at     25
a      21
ax     19
am     18
aq     18
i      18
u      17
l      16
aw     16
ad     14
b      11
k      11
au     11
as     10
r      10
bc      6
ao      4
c       3
aa      2
q       2
ab      1
ac      1
g       1
Name: X0, dtype: int64
aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
w      52
z      46
u      37
e      33
m      32
t      31
h      29
f      23
y      23
j      22
n      19
k      17
p       9
g       6
q       3
d       3
ab      3
Name: X1, dtype: int64
as    1659
ae     496
ai     415
m      367
ak     265
r      153
n      137
s       94
f       87
e       81
aq      63
ay      54
a       47
t       29
i       25
k       25
b       21
ao      20
ag      19
z       19
d       18
ac      13
g       12
ap      11
y       11
x       10
aw       8
h        6
at       6
q        5
an       5
al       5
av       4
ah       4
p        4
au       3
l        1
aa       1
ar       1
j        1
c        1
o        1
am       1
af       1
Name: X2, dtype: int64
c    1942
f    1076
a     440
d     290
g     241
e     163
b      57
Name: X3, dtype: int64
d    4205
a       2
b       1
c       1
Name: X4, dtype: int64
v     231
w     231
q     220
r     215
s     214
d     214
n     212
p     208
m     208
i     207
ae    205
ag    204
ac    200
ab    197
l     195
af    188
ad    185
k     177
c     131
j     125
aa    112
ah     97
o      20
f       7
x       2
y       1
u       1
h       1
g       1
Name: X5, dtype: int64
g    1042
j    1039
d     625
i     488
l     478
a     206
h     190
k      43
c      38
b      28
f      20
e      12
Name: X6, dtype: int64
j    277
s    255
f    243
n    242
i    237
e    225
r    219
a    210
w    196
v    194
b    190
k    176
o    163
m    155
g    130
u    119
t    119
q    117
h    117
y    116
x    105
d    103
l    101
c    100
p    100
Name: X8, dtype: int64

In [14]:
### Showing all unique values in X0 features.
mer_df['X0'].unique()

array(['k', 'az', 't', 'al', 'o', 'w', 'j', 'h', 's', 'n', 'ay', 'f', 'x',
       'y', 'aj', 'ak', 'am', 'z', 'q', 'at', 'ap', 'v', 'af', 'a', 'e',
       'ai', 'd', 'aq', 'c', 'aa', 'ba', 'as', 'i', 'r', 'b', 'ax', 'bc',
       'u', 'ad', 'au', 'm', 'l', 'aw', 'ao', 'ac', 'g', 'ab'],
      dtype=object)

In [15]:
### counting all unique values in features.
len(mer_df['X0'].unique())

47

In [16]:
### finding the total number of categories in all features.
for i in mer_df.columns:
    print(len(mer_df[i].unique()))

47
27
44
7
4
29
12
25

In [17]:
mer_df['X0'].value_counts()

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
ai     34
m      34
e      32
ba     27
at     25
a      21
ax     19
am     18
aq     18
i      18
u      17
l      16
aw     16
ad     14
b      11
k      11
au     11
as     10
r      10
bc      6
ao      4
c       3
aa      2
q       2
ab      1
ac      1
g       1
Name: X0, dtype: int64

In [18]:
### fetching top 10 record from feature X0.
mer_df['X0'].value_counts().sort_values(ascending=False).head(10)

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
Name: X0, dtype: int64

In [19]:
lst_10=mer_df['X0'].value_counts().sort_values(ascending=False).head(10).index
lst_10

Index(['z', 'ak', 'y', 'ay', 't', 'x', 'o', 'f', 'n', 'w'], dtype='object')

In [20]:
### converting type index into list.
lst_10=list(lst_10)
lst_10

['z', 'ak', 'y', 'ay', 't', 'x', 'o', 'f', 'n', 'w']

In [21]:
for categories in lst_10:
    mer_df['categories']=np.where(mer_df['X0']==categories,1,0)

In [22]:
lst_10.append('X0')

### 3) Ordinal Number Encoding Technique.

In [23]:
import datetime as dt

In [24]:
todays_date=dt.datetime.today()
todays_date

datetime.datetime(2020, 8, 8, 10, 7, 16, 132943)

In [25]:
### creating list comprehesive for collecting 15 days record.
days=[todays_date-dt.timedelta(x) for x in range(0,15)]

In [26]:
import pandas as pd
### converting days into dataframe.
Data=pd.DataFrame(days)
Data.columns=['Days']
Data

                         Days
0  2020-08-08 10:07:16.132943
1  2020-08-07 10:07:16.132943
2  2020-08-06 10:07:16.132943
3  2020-08-05 10:07:16.132943
4  2020-08-04 10:07:16.132943
5  2020-08-03 10:07:16.132943
6  2020-08-02 10:07:16.132943
7  2020-08-01 10:07:16.132943
8  2020-07-31 10:07:16.132943
9  2020-07-30 10:07:16.132943
10 2020-07-29 10:07:16.132943
11 2020-07-28 10:07:16.132943
12 2020-07-27 10:07:16.132943
13 2020-07-26 10:07:16.132943
14 2020-07-25 10:07:16.132943

In [27]:
### Display weekdays.
Data['Weekdays']=Data['Days'].dt.day_name()
Data.head()

                        Days   Weekdays
0 2020-08-08 10:07:16.132943   Saturday
1 2020-08-07 10:07:16.132943     Friday
2 2020-08-06 10:07:16.132943   Thursday
3 2020-08-05 10:07:16.132943  Wednesday
4 2020-08-04 10:07:16.132943    Tuesday

In [28]:
### Creating a dictionary.
dictionary={'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7
            }

In [29]:
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [30]:
Data['Weekdays_Ordinal']=Data['Weekdays'].map(dictionary)
Data.head()

                        Days   Weekdays  Weekdays_Ordinal
0 2020-08-08 10:07:16.132943   Saturday                 6
1 2020-08-07 10:07:16.132943     Friday                 5
2 2020-08-06 10:07:16.132943   Thursday                 4
3 2020-08-05 10:07:16.132943  Wednesday                 3
4 2020-08-04 10:07:16.132943    Tuesday                 2

### 4) Target Guided Ordinal Encoding.
1) Order label according to target.
2) Replace the lables by the joint probablity og being 1 or 0.

In [31]:
titanic=pd.read_csv("E://Datasets//Miscellaneous//Titanic//train.csv",usecols=['Cabin','Survived'])
titanic.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [32]:
titanic['Cabin'].fillna('Missing',inplace=True)

In [33]:
titanic.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [36]:
titanic['Cabin']=titanic['Cabin'].astype(str).str[0]

In [37]:
titanic.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [38]:
titanic['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [40]:
### finding the % of survived people base on thee cabin.
titanic.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [44]:
ordinal_labels=titanic.groupby(['Cabin'])['Survived'].mean().sort_values().index

In [45]:
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [51]:
ordinal_label2={k:i for i,k in enumerate(ordinal_labels,0) }

In [52]:
ordinal_label2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [53]:
titanic['Cabim_Ordinal_Label']=titanic['Cabin'].map(ordinal_label2)

In [55]:
titanic.head(10)

   Survived Cabin  Cabim_Ordinal_Label
0         0     M                    1
1         1     C                    4
2         1     M                    1
3         1     C                    4
4         0     M                    1
5         0     M                    1
6         0     E                    7
7         0     M                    1
8         1     M                    1
9         1     M                    1

### 5) Mean Encoding Technique.

In [56]:
titanic=pd.read_csv("E://Datasets//Miscellaneous//Titanic//train.csv",usecols=['Cabin','Survived'])
titanic.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [57]:
titanic['Cabin'].fillna('Missing',inplace=True)

In [58]:
titanic.head(10)

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing
5         0  Missing
6         0      E46
7         0  Missing
8         1  Missing
9         1  Missing

In [65]:
titanic['Cabin']=titanic['Cabin'].astype(str).str[0]
titanic.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [63]:
titanic['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [69]:
### finding the % of survived people base on thee cabin.
mean_ordinal=titanic.groupby(['Cabin'])['Survived'].mean().to_dict()

In [70]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [71]:
titanic['Mean_ordinal_encoding']=titanic['Cabin'].map(mean_ordinal)

In [73]:
titanic.head()

   Survived Cabin  Mean_ordinal_encoding
0         0     M               0.299854
1         1     C               0.593220
2         1     M               0.299854
3         1     C               0.593220
4         0     M               0.299854

### 6) Probability ation Encoding Technique.

In [74]:
titanic=pd.read_csv("E://Datasets//Miscellaneous//Titanic//train.csv",usecols=['Cabin','Survived'])
titanic.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [77]:
### Filling NaN values.
titanic['Cabin'].fillna('Missing',inplace=True)

In [78]:
titanic.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [79]:
titanic['Cabin'].unique()

array(['Missing', 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [81]:
### Finding the first letter of every datapoints.
titanic['Cabin']=titanic['Cabin'].astype(str).str[0]
titanic.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [82]:
titanic['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [90]:
### FInding the probability of data.
prob_df=titanic.groupby(['Cabin'])['Survived'].mean()

In [91]:
prob_df.head()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
Name: Survived, dtype: float64

In [92]:
prob_df=pd.DataFrame(prob_df)

In [93]:
prob_df

       Survived
Cabin
A      0.466667
B      0.744681
C      0.593220
D      0.757576
E      0.750000
F      0.615385
G      0.500000
M      0.299854
T      0.000000

In [94]:
### Finding the probabily of Died people.
prob_df['Died']=1-prob_df['Survived']

In [95]:
prob_df

       Survived      Died
Cabin
A      0.466667  0.533333
B      0.744681  0.255319
C      0.593220  0.406780
D      0.757576  0.242424
E      0.750000  0.250000
F      0.615385  0.384615
G      0.500000  0.500000
M      0.299854  0.700146
T      0.000000  1.000000

In [96]:
### Finding the probabilty ratio.
prob_df['Probability_ratio']=prob_df['Survived']/prob_df['Died']

In [97]:
prob_df.head()

       Survived      Died  Probability_ratio
Cabin
A      0.466667  0.533333           0.875000
B      0.744681  0.255319           2.916667
C      0.593220  0.406780           1.458333
D      0.757576  0.242424           3.125000
E      0.750000  0.250000           3.000000

In [98]:
### Converting valuues into dictinory.
probability_encoded=prob_df['Probability_ratio'].to_dict()

In [102]:
probability_encoded

{'A': 0.875,
 'B': 2.916666666666666,
 'C': 1.4583333333333333,
 'D': 3.125,
 'E': 3.0,
 'F': 1.6000000000000003,
 'G': 1.0,
 'M': 0.42827442827442824,
 'T': 0.0}

In [99]:
titanic['Cabin_encoded']=titanic['Cabin'].map(probability_encoded)

In [100]:
titanic.head()

   Survived Cabin  Cabin_encoded
0         0     M       0.428274
1         1     C       1.458333
2         1     M       0.428274
3         1     C       1.458333
4         0     M       0.428274